app/controllers/auth_controller.rb

  def token_authenticate
    token = request.headers["Authenticate"]
    user = User.find(decode(token)["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]