app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "test"], ["password_digest", "[FILTERED]"], ["created_at", "2022-06-02 04:54:27.384581"], ["updated_at", "2022-06-02 04:54:27.384581"]]
---
  def create
    user = User.create(user_params)